//=============================================================================
//
// 殺球棒 [kill_stick.h]
// Author : 小笠原　彪我
//
//=============================================================================
#ifndef _KILL_STICK_H_
#define _KILL_STICK_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "manager.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define KILLSTICK_X_FILL	"data/MODEL/KillBallStick3.x"	// モデルファイル
#define MOVE_KILLSTICK		3.0f							// 移動量
#define POS_CENTER			0.0f							// 中心座標
#define REFRECT_DIFF_INC	100.0f							// 反射位置を計算する差分/増分
//=============================================================================
// 前方宣言
//=============================================================================
class CModelSingle;

//*****************************************************************************
//	殺球棒クラス
//*****************************************************************************
class CKillStick : public CScene
{
public:
	CKillStick();	// コンストラクタ
	~CKillStick();	// デストラクタ

	HRESULT Init(void);		// 初期化処理
	void Uninit(void);		// 終了処理
	void Update(void);		// 更新処理
	void Draw(void);		// 描画処理

					
	// 第一引数：位置を設定　第二引数：向きを設定　第三引数：左の反射位置を設定　第四引数：右の反射位置を設定　第五引数：左右の周期を設定	 
	static CKillStick *Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot);	// 生成処理		

private:
	CModelSingle	*m_pModelSingle;	// モデル
	D3DXVECTOR3		m_pos;				// 位置
	D3DXVECTOR3		m_rot;				// 向き
	D3DXVECTOR3		m_move;				// 移動量
	float			m_fReflectLeft;		// 左の反射位置
	float			m_fReflectRight;	// 右の反射位置
	bool			m_bReflection;		// 反射判定
};
#endif